{"modelTopology":{"class_name":"Sequential","config":{"name":"sequential_558","layers":[{"class_name":"Dense","config":{"units":131,"activation":"tanh","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense2786","trainable":true,"batch_input_shape":[null,1]}},{"class_name":"Dense","config":{"units":8,"activation":"tanh","use_bias":true,"kernel_initializer":{"class_name":"RandomUniform","config":{"minval":-1,"maxval":1,"seed":null}},"bias_initializer":{"class_name":"RandomNormal","config":{"mean":0,"stddev":0.05,"seed":null}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense2787","trainable":true}},{"class_name":"Dense","config":{"units":8,"activation":"tanh","use_bias":true,"kernel_initializer":{"class_name":"RandomUniform","config":{"minval":-1,"maxval":1,"seed":null}},"bias_initializer":{"class_name":"RandomNormal","config":{"mean":0,"stddev":0.05,"seed":null}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense2788","trainable":true}},{"class_name":"Dense","config":{"units":8,"activation":"tanh","use_bias":true,"kernel_initializer":{"class_name":"RandomUniform","config":{"minval":-1,"maxval":1,"seed":null}},"bias_initializer":{"class_name":"RandomNormal","config":{"mean":0,"stddev":0.05,"seed":null}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense2789","trainable":true}},{"class_name":"Dense","config":{"units":7,"activation":"linear","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense2790","trainable":true}}]},"keras_version":"tfjs-layers 1.5.2","backend":"tensor_flow.js"},"format":"layers-model","generatedBy":"TensorFlow.js tfjs-layers v1.5.2","convertedBy":null,"weightsManifest":[{"paths":["./rts/G92_P1_Explorer_439_M_9.4.weights.bin"],"weights":[{"name":"dense_Dense2786/kernel","shape":[1,131],"dtype":"float32"},{"name":"dense_Dense2786/bias","shape":[131],"dtype":"float32"},{"name":"dense_Dense2787/kernel","shape":[131,8],"dtype":"float32"},{"name":"dense_Dense2787/bias","shape":[8],"dtype":"float32"},{"name":"dense_Dense2788/kernel","shape":[8,8],"dtype":"float32"},{"name":"dense_Dense2788/bias","shape":[8],"dtype":"float32"},{"name":"dense_Dense2789/kernel","shape":[8,8],"dtype":"float32"},{"name":"dense_Dense2789/bias","shape":[8],"dtype":"float32"},{"name":"dense_Dense2790/kernel","shape":[8,7],"dtype":"float32"},{"name":"dense_Dense2790/bias","shape":[7],"dtype":"float32"}]}]}