{"modelTopology":{"class_name":"Sequential","config":{"name":"sequential_541","layers":[{"class_name":"Dense","config":{"units":131,"activation":"tanh","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense2701","trainable":true,"batch_input_shape":[null,1]}},{"class_name":"Dense","config":{"units":8,"activation":"tanh","use_bias":true,"kernel_initializer":{"class_name":"RandomUniform","config":{"minval":-1,"maxval":1,"seed":null}},"bias_initializer":{"class_name":"RandomNormal","config":{"mean":0,"stddev":0.05,"seed":null}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense2702","trainable":true}},{"class_name":"Dense","config":{"units":8,"activation":"tanh","use_bias":true,"kernel_initializer":{"class_name":"RandomUniform","config":{"minval":-1,"maxval":1,"seed":null}},"bias_initializer":{"class_name":"RandomNormal","config":{"mean":0,"stddev":0.05,"seed":null}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense2703","trainable":true}},{"class_name":"Dense","config":{"units":8,"activation":"tanh","use_bias":true,"kernel_initializer":{"class_name":"RandomUniform","config":{"minval":-1,"maxval":1,"seed":null}},"bias_initializer":{"class_name":"RandomNormal","config":{"mean":0,"stddev":0.05,"seed":null}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense2704","trainable":true}},{"class_name":"Dense","config":{"units":7,"activation":"linear","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense2705","trainable":true}}]},"keras_version":"tfjs-layers 1.5.2","backend":"tensor_flow.js"},"format":"layers-model","generatedBy":"TensorFlow.js tfjs-layers v1.5.2","convertedBy":null,"weightsManifest":[{"paths":["./rts/G89_P2_Explorer_485_C_8.5.weights.bin"],"weights":[{"name":"dense_Dense2701/kernel","shape":[1,131],"dtype":"float32"},{"name":"dense_Dense2701/bias","shape":[131],"dtype":"float32"},{"name":"dense_Dense2702/kernel","shape":[131,8],"dtype":"float32"},{"name":"dense_Dense2702/bias","shape":[8],"dtype":"float32"},{"name":"dense_Dense2703/kernel","shape":[8,8],"dtype":"float32"},{"name":"dense_Dense2703/bias","shape":[8],"dtype":"float32"},{"name":"dense_Dense2704/kernel","shape":[8,8],"dtype":"float32"},{"name":"dense_Dense2704/bias","shape":[8],"dtype":"float32"},{"name":"dense_Dense2705/kernel","shape":[8,7],"dtype":"float32"},{"name":"dense_Dense2705/bias","shape":[7],"dtype":"float32"}]}]}