{"modelTopology":{"class_name":"Sequential","config":{"name":"sequential_493","layers":[{"class_name":"Dense","config":{"units":131,"activation":"tanh","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense2461","trainable":true,"batch_input_shape":[null,1]}},{"class_name":"Dense","config":{"units":8,"activation":"tanh","use_bias":true,"kernel_initializer":{"class_name":"RandomUniform","config":{"minval":-1,"maxval":1,"seed":null}},"bias_initializer":{"class_name":"RandomNormal","config":{"mean":0,"stddev":0.05,"seed":null}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense2462","trainable":true}},{"class_name":"Dense","config":{"units":8,"activation":"tanh","use_bias":true,"kernel_initializer":{"class_name":"RandomUniform","config":{"minval":-1,"maxval":1,"seed":null}},"bias_initializer":{"class_name":"RandomNormal","config":{"mean":0,"stddev":0.05,"seed":null}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense2463","trainable":true}},{"class_name":"Dense","config":{"units":8,"activation":"tanh","use_bias":true,"kernel_initializer":{"class_name":"RandomUniform","config":{"minval":-1,"maxval":1,"seed":null}},"bias_initializer":{"class_name":"RandomNormal","config":{"mean":0,"stddev":0.05,"seed":null}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense2464","trainable":true}},{"class_name":"Dense","config":{"units":7,"activation":"linear","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense2465","trainable":true}}]},"keras_version":"tfjs-layers 1.5.2","backend":"tensor_flow.js"},"format":"layers-model","generatedBy":"TensorFlow.js tfjs-layers v1.5.2","convertedBy":null,"weightsManifest":[{"paths":["./rts/G81_P1_Explorer_605_C_8.5.weights.bin"],"weights":[{"name":"dense_Dense2461/kernel","shape":[1,131],"dtype":"float32"},{"name":"dense_Dense2461/bias","shape":[131],"dtype":"float32"},{"name":"dense_Dense2462/kernel","shape":[131,8],"dtype":"float32"},{"name":"dense_Dense2462/bias","shape":[8],"dtype":"float32"},{"name":"dense_Dense2463/kernel","shape":[8,8],"dtype":"float32"},{"name":"dense_Dense2463/bias","shape":[8],"dtype":"float32"},{"name":"dense_Dense2464/kernel","shape":[8,8],"dtype":"float32"},{"name":"dense_Dense2464/bias","shape":[8],"dtype":"float32"},{"name":"dense_Dense2465/kernel","shape":[8,7],"dtype":"float32"},{"name":"dense_Dense2465/bias","shape":[7],"dtype":"float32"}]}]}